<?php
return [
    'english' => ' الإنجليزية ',
    'arabic' => ' العربية ',
    'home' => ' الرئيسية ',
    'about_us'=> 'من نحن',
    'contact_us'=> 'تواصل معنا',
    'register_title' => 'نموذج التسجيل',
    'name' => 'الاسم الكامل',
    'username' => 'اسم المستخدم',
    'phone' => 'رقم الهاتف',
    'whats' => 'رقم الواتساب',
    'address' => 'العنوان',
    'email' => 'البريد الإلكتروني',
    'password' => 'كلمة المرور',
    'create_account' => 'إرسال',
    'page_title' => 'صفحة التسجيل',
    'confirm_password' => 'تأكيد كلمة المرور',
    'user_image' => 'صورة المستخدم',
    'choose_image' => 'اختر صورة',
    'check_number' => 'تحقق من الرقم',
        'required_field' => '*',

    // Footer
    'footer' => 'جميع الحقوق محفوظة ©️ 2025 نموذج التسجيل.',

    // Validation Messages (Client-Side JS)
    'full_name_error' => 'يجب أن يحتوي الاسم الكامل على أحرف ومسافات فقط.',
    'user_name_error' => 'يجب أن يتكون اسم المستخدم من 3 إلى 15 حرفًا ويمكن أن يحتوي على حروف وأرقام و _ أو .',
    'phone_error' => 'رقم الهاتف غير صحيح. يجب أن يتكون من 11 رقمًا ويبدأ بـ 010 أو 011 أو 012 أو 015.',
    'email_error' => 'عنوان البريد الإلكتروني غير صالح.',
    'password_error' => 'يجب أن تتكون كلمة المرور من 8 أحرف على الأقل وتحتوي على رقم واحد وحرف خاص واحد على الأقل.',
    'confirm_password_error' => 'كلمتا المرور غير متطابقتين.',
    'whatsapp' => 'يرجى إدخال رقم واتساب صحيح مكون من 11 رقمًا ويبدأ بـ 010 أو 011 أو 012 أو 015.',
    'whatsapp_valid' => 'رقم واتساب صالح.',
    'whatsapp_invalid' => 'رقم واتساب غير صالح.',
    'whatsapp_unavailable' => 'خدمة التحقق من رقم الواتساب غير متاحة حاليًا. يرجى المحاولة لاحقًا.',
    'whatsapp_verify' => 'يرجى التحقق من رقم الواتساب قبل الإرسال.',
    'address_error' => 'العنوان مطلوب.',
    'image_error' => 'يرجى رفع صورة للمستخدم.',


];
